
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/takahiro-impara/pd-iac/actions/runs/8586541954)



<pre><code>Apply complete! Resources: 11 added, 0 changed, 10 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.pagerduty_vendor.vendor: Reading...
pagerduty_team.pd_team["poc-k8s"]: Refreshing state... [id=P31QTVE]
pagerduty_team.pd_team["poc-pd"]: Refreshing state... [id=P6ABU84]
pagerduty_user.pd_user["imparapoc03@gmail.com"]: Refreshing state... [id=POCJ4A2]
data.pagerduty_vendor.vendor: Read complete after 0s [id=PAM4FGS]
module.pd_team_association["imparapoc03@gmail.com"].pagerduty_team_membership.team_membership["poc-k8s"]: Refreshing state... [id=POCJ4A2:P31QTVE]
module.pd_team_association["imparapoc03@gmail.com"].pagerduty_team_membership.team_membership["poc-pd"]: Refreshing state... [id=POCJ4A2:P6ABU84]
pagerduty_escalation_policy.pd_esp["poc-pd-svc"]: Refreshing state... [id=PT2I0VP]
pagerduty_escalation_policy.pd_esp["poc-pk8s-svc"]: Refreshing state... [id=PWC617C]
pagerduty_service.pd_service["poc-pk8s-svc"]: Refreshing state... [id=P5K9TRC]
pagerduty_service.pd_service["poc-pd-svc"]: Refreshing state... [id=P9WXU42]
pagerduty_service_integration.datadog["poc-pd-svc"]: Refreshing state... [id=P3H8M53]
pagerduty_service_integration.datadog["poc-pk8s-svc"]: Refreshing state... [id=P7TWMHT]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.pagerduty_users.pd_users["poc-order-management"] will be read during apply
  # (config refers to values not yet known)
 <= data "pagerduty_users" "pd_users" {
      + id       = (known after apply)
      + team_ids = [
          + (known after apply),
        ]
      + users    = (known after apply)
    }

  # data.pagerduty_users.pd_users["poc-payment"] will be read during apply
  # (config refers to values not yet known)
 <= data "pagerduty_users" "pd_users" {
      + id       = (known after apply)
      + team_ids = [
          + (known after apply),
        ]
      + users    = (known after apply)
    }

  # pagerduty_escalation_policy.pd_esp["poc-order-management"] will be created
  + resource "pagerduty_escalation_policy" "pd_esp" {
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "escalation-policy-poc-order-management"
      + num_loops   = 3
      + teams       = (known after apply)

      + rule {
          + escalation_delay_in_minutes = 10
          + id                          = (known after apply)

          + target {
              + id   = (known after apply)
              + type = "user_reference"
            }
        }
    }

  # pagerduty_escalation_policy.pd_esp["poc-payment"] will be created
  + resource "pagerduty_escalation_policy" "pd_esp" {
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "escalation-policy-poc-payment"
      + num_loops   = 3
      + teams       = (known after apply)

      + rule {
          + escalation_delay_in_minutes = 10
          + id                          = (known after apply)

          + target {
              + id   = (known after apply)
              + type = "user_reference"
            }
        }
    }

  # pagerduty_escalation_policy.pd_esp["poc-pd-svc"] will be destroyed
  # (because key ["poc-pd-svc"] is not in for_each map)
  - resource "pagerduty_escalation_policy" "pd_esp" {
      - description = "Managed by Terraform" -> null
      - id          = "PT2I0VP" -> null
      - name        = "escalation-policy-poc-pd-svc" -> null
      - num_loops   = 3 -> null
      - teams       = [
          - "P6ABU84",
        ] -> null

      - rule {
          - escalation_delay_in_minutes = 10 -> null
          - id                          = "PWOJWCM" -> null

          - escalation_rule_assignment_strategy {
              - type = "assign_to_everyone" -> null
            }

          - target {
              - id   = "POCJ4A2" -> null
              - type = "user_reference" -> null
            }
        }
    }

  # pagerduty_escalation_policy.pd_esp["poc-pk8s-svc"] will be destroyed
  # (because key ["poc-pk8s-svc"] is not in for_each map)
  - resource "pagerduty_escalation_policy" "pd_esp" {
      - description = "Managed by Terraform" -> null
      - id          = "PWC617C" -> null
      - name        = "escalation-policy-poc-pk8s-svc" -> null
      - num_loops   = 3 -> null
      - teams       = [
          - "P31QTVE",
        ] -> null

      - rule {
          - escalation_delay_in_minutes = 10 -> null
          - id                          = "PZL7XSP" -> null

          - escalation_rule_assignment_strategy {
              - type = "assign_to_everyone" -> null
            }

          - target {
              - id   = "POCJ4A2" -> null
              - type = "user_reference" -> null
            }
        }
    }

  # pagerduty_service.pd_service["poc-order-management"] will be created
  + resource "pagerduty_service" "pd_service" {
      + acknowledgement_timeout = "1200"
      + alert_grouping          = (known after apply)
      + alert_grouping_timeout  = (known after apply)
      + auto_resolve_timeout    = "86400"
      + created_at              = (known after apply)
      + description             = "Managed by Terraform"
      + escalation_policy       = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + last_incident_timestamp = (known after apply)
      + name                    = "poc-order-management"
      + response_play           = (known after apply)
      + status                  = (known after apply)
      + type                    = (known after apply)

      + alert_grouping_parameters {
          + type = "intelligent"
        }

      + auto_pause_notifications_parameters {
          + enabled = true
          + timeout = 300
        }
    }

  # pagerduty_service.pd_service["poc-payment"] will be created
  + resource "pagerduty_service" "pd_service" {
      + acknowledgement_timeout = "1200"
      + alert_grouping          = (known after apply)
      + alert_grouping_timeout  = (known after apply)
      + auto_resolve_timeout    = "86400"
      + created_at              = (known after apply)
      + description             = "Managed by Terraform"
      + escalation_policy       = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + last_incident_timestamp = (known after apply)
      + name                    = "poc-payment"
      + response_play           = (known after apply)
      + status                  = (known after apply)
      + type                    = (known after apply)

      + alert_grouping_parameters {
          + type = "intelligent"
        }

      + auto_pause_notifications_parameters {
          + enabled = true
          + timeout = 300
        }
    }

  # pagerduty_service.pd_service["poc-pd-svc"] will be destroyed
  # (because key ["poc-pd-svc"] is not in for_each map)
  - resource "pagerduty_service" "pd_service" {
      - acknowledgement_timeout = "1200" -> null
      - alert_creation          = "create_alerts_and_incidents" -> null
      - alert_grouping          = "intelligent" -> null
      - alert_grouping_timeout  = "null" -> null
      - auto_resolve_timeout    = "86400" -> null
      - created_at              = "2024-03-11T14:09:14+09:00" -> null
      - description             = "Managed by Terraform" -> null
      - escalation_policy       = "PT2I0VP" -> null
      - html_url                = "https://fastretailing-staging.pagerduty.com/service-directory/P9WXU42" -> null
      - id                      = "P9WXU42" -> null
      - last_incident_timestamp = "2024-03-23T16:09:40+09:00" -> null
      - name                    = "poc-pd-svc" -> null
      - status                  = "active" -> null
      - type                    = "service" -> null

      - alert_grouping_parameters {
          - type = "intelligent" -> null

          - config {
              - fields      = [] -> null
              - time_window = 300 -> null
              - timeout     = 0 -> null
            }
        }

      - auto_pause_notifications_parameters {
          - enabled = true -> null
          - timeout = 300 -> null
        }

      - incident_urgency_rule {
          - type    = "constant" -> null
          - urgency = "high" -> null
        }
    }

  # pagerduty_service.pd_service["poc-pk8s-svc"] will be destroyed
  # (because key ["poc-pk8s-svc"] is not in for_each map)
  - resource "pagerduty_service" "pd_service" {
      - acknowledgement_timeout = "1200" -> null
      - alert_creation          = "create_alerts_and_incidents" -> null
      - alert_grouping          = "intelligent" -> null
      - alert_grouping_timeout  = "null" -> null
      - auto_resolve_timeout    = "86400" -> null
      - created_at              = "2024-03-11T14:09:14+09:00" -> null
      - description             = "Managed by Terraform" -> null
      - escalation_policy       = "PWC617C" -> null
      - html_url                = "https://fastretailing-staging.pagerduty.com/service-directory/P5K9TRC" -> null
      - id                      = "P5K9TRC" -> null
      - last_incident_timestamp = "2024-03-23T16:02:53+09:00" -> null
      - name                    = "poc-pk8s-svc" -> null
      - status                  = "active" -> null
      - type                    = "service" -> null

      - alert_grouping_parameters {
          - type = "intelligent" -> null

          - config {
              - fields      = [] -> null
              - time_window = 300 -> null
              - timeout     = 0 -> null
            }
        }

      - auto_pause_notifications_parameters {
          - enabled = true -> null
          - timeout = 300 -> null
        }

      - incident_urgency_rule {
          - type    = "constant" -> null
          - urgency = "high" -> null
        }
    }

  # pagerduty_service_integration.datadog["poc-order-management"] will be created
  + resource "pagerduty_service_integration" "datadog" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "datadog-integration-poc-order-management"
      + service                 = (known after apply)
      + type                    = (known after apply)
      + vendor                  = "PAM4FGS"
    }

  # pagerduty_service_integration.datadog["poc-payment"] will be created
  + resource "pagerduty_service_integration" "datadog" {
      + email_filter_mode       = (known after apply)
      + email_incident_creation = (known after apply)
      + email_parsing_fallback  = (known after apply)
      + html_url                = (known after apply)
      + id                      = (known after apply)
      + integration_email       = (known after apply)
      + integration_key         = (known after apply)
      + name                    = "datadog-integration-poc-payment"
      + service                 = (known after apply)
      + type                    = (known after apply)
      + vendor                  = "PAM4FGS"
    }

  # pagerduty_service_integration.datadog["poc-pd-svc"] will be destroyed
  # (because key ["poc-pd-svc"] is not in for_each map)
  - resource "pagerduty_service_integration" "datadog" {
      - html_url        = "https://fastretailing-staging.pagerduty.com/services/P9WXU42/integrations/P3H8M53" -> null
      - id              = "P3H8M53" -> null
      - integration_key = "7d847e71b73e400bc0fb2fe9500fb1ca" -> null
      - name            = "datadog-integration-poc-pd-svc" -> null
      - service         = "P9WXU42" -> null
      - type            = "generic_events_api_inbound_integration" -> null
      - vendor          = "PAM4FGS" -> null
    }

  # pagerduty_service_integration.datadog["poc-pk8s-svc"] will be destroyed
  # (because key ["poc-pk8s-svc"] is not in for_each map)
  - resource "pagerduty_service_integration" "datadog" {
      - html_url        = "https://fastretailing-staging.pagerduty.com/services/P5K9TRC/integrations/P7TWMHT" -> null
      - id              = "P7TWMHT" -> null
      - integration_key = "748c66ea3efe4602c0e4334184d9b84e" -> null
      - name            = "datadog-integration-poc-pk8s-svc" -> null
      - service         = "P5K9TRC" -> null
      - type            = "generic_events_api_inbound_integration" -> null
      - vendor          = "PAM4FGS" -> null
    }

  # pagerduty_team.pd_team["order-management"] will be created
  + resource "pagerduty_team" "pd_team" {
      + default_role = (known after apply)
      + description  = "Managed by Terraform"
      + html_url     = (known after apply)
      + id           = (known after apply)
      + name         = "order-management"
    }

  # pagerduty_team.pd_team["payment"] will be created
  + resource "pagerduty_team" "pd_team" {
      + default_role = (known after apply)
      + description  = "Managed by Terraform"
      + html_url     = (known after apply)
      + id           = (known after apply)
      + name         = "payment"
    }

  # pagerduty_team.pd_team["poc-k8s"] will be destroyed
  # (because key ["poc-k8s"] is not in for_each map)
  - resource "pagerduty_team" "pd_team" {
      - default_role = "manager" -> null
      - description  = "Managed by Terraform" -> null
      - html_url     = "https://fastretailing-staging.pagerduty.com/teams/P31QTVE" -> null
      - id           = "P31QTVE" -> null
      - name         = "poc-k8s" -> null
    }

  # pagerduty_team.pd_team["poc-pd"] will be destroyed
  # (because key ["poc-pd"] is not in for_each map)
  - resource "pagerduty_team" "pd_team" {
      - default_role = "manager" -> null
      - description  = "Managed by Terraform" -> null
      - html_url     = "https://fastretailing-staging.pagerduty.com/teams/P6ABU84" -> null
      - id           = "P6ABU84" -> null
      - name         = "poc-pd" -> null
    }

  # pagerduty_team.pd_team["shipping"] will be created
  + resource "pagerduty_team" "pd_team" {
      + default_role = (known after apply)
      + description  = "Managed by Terraform"
      + html_url     = (known after apply)
      + id           = (known after apply)
      + name         = "shipping"
    }

  # module.pd_team_association["imparapoc03@gmail.com"].pagerduty_team_membership.team_membership["order-management"] will be created
  + resource "pagerduty_team_membership" "team_membership" {
      + id      = (known after apply)
      + role    = "manager"
      + team_id = (known after apply)
      + user_id = "POCJ4A2"
    }

  # module.pd_team_association["imparapoc03@gmail.com"].pagerduty_team_membership.team_membership["payment"] will be created
  + resource "pagerduty_team_membership" "team_membership" {
      + id      = (known after apply)
      + role    = "manager"
      + team_id = (known after apply)
      + user_id = "POCJ4A2"
    }

  # module.pd_team_association["imparapoc03@gmail.com"].pagerduty_team_membership.team_membership["poc-k8s"] will be destroyed
  # (because key ["poc-k8s"] is not in for_each map)
  - resource "pagerduty_team_membership" "team_membership" {
      - id      = "POCJ4A2:P31QTVE" -> null
      - role    = "manager" -> null
      - team_id = "P31QTVE" -> null
      - user_id = "POCJ4A2" -> null
    }

  # module.pd_team_association["imparapoc03@gmail.com"].pagerduty_team_membership.team_membership["poc-pd"] will be destroyed
  # (because key ["poc-pd"] is not in for_each map)
  - resource "pagerduty_team_membership" "team_membership" {
      - id      = "POCJ4A2:P6ABU84" -> null
      - role    = "manager" -> null
      - team_id = "P6ABU84" -> null
      - user_id = "POCJ4A2" -> null
    }

Plan: 11 to add, 0 to change, 10 to destroy.
pagerduty_service_integration.datadog["poc-pk8s-svc"]: Destroying... [id=P7TWMHT]
pagerduty_service_integration.datadog["poc-pd-svc"]: Destroying... [id=P3H8M53]
pagerduty_service_integration.datadog["poc-pd-svc"]: Destruction complete after 0s
pagerduty_service_integration.datadog["poc-pk8s-svc"]: Destruction complete after 0s
pagerduty_service.pd_service["poc-pd-svc"]: Destroying... [id=P9WXU42]
pagerduty_service.pd_service["poc-pk8s-svc"]: Destroying... [id=P5K9TRC]
pagerduty_service.pd_service["poc-pk8s-svc"]: Destruction complete after 2s
pagerduty_service.pd_service["poc-pd-svc"]: Destruction complete after 2s
pagerduty_escalation_policy.pd_esp["poc-pk8s-svc"]: Destroying... [id=PWC617C]
pagerduty_escalation_policy.pd_esp["poc-pd-svc"]: Destroying... [id=PT2I0VP]
pagerduty_escalation_policy.pd_esp["poc-pd-svc"]: Destruction complete after 1s
pagerduty_escalation_policy.pd_esp["poc-pk8s-svc"]: Destruction complete after 1s
module.pd_team_association["imparapoc03@gmail.com"].pagerduty_team_membership.team_membership["poc-k8s"]: Destroying... [id=POCJ4A2:P31QTVE]
module.pd_team_association["imparapoc03@gmail.com"].pagerduty_team_membership.team_membership["poc-pd"]: Destroying... [id=POCJ4A2:P6ABU84]
module.pd_team_association["imparapoc03@gmail.com"].pagerduty_team_membership.team_membership["poc-k8s"]: Destruction complete after 0s
module.pd_team_association["imparapoc03@gmail.com"].pagerduty_team_membership.team_membership["poc-pd"]: Destruction complete after 0s
pagerduty_team.pd_team["poc-k8s"]: Destroying... [id=P31QTVE]
pagerduty_team.pd_team["poc-pd"]: Destroying... [id=P6ABU84]
pagerduty_team.pd_team["shipping"]: Creating...
pagerduty_team.pd_team["payment"]: Creating...
pagerduty_team.pd_team["order-management"]: Creating...
pagerduty_team.pd_team["order-management"]: Creation complete after 1s [id=PWPNALU]
pagerduty_team.pd_team["shipping"]: Creation complete after 1s [id=PSCMA94]
pagerduty_team.pd_team["payment"]: Creation complete after 1s [id=PP3BZWE]
pagerduty_team.pd_team["poc-pd"]: Destruction complete after 2s
pagerduty_team.pd_team["poc-k8s"]: Destruction complete after 2s
module.pd_team_association["imparapoc03@gmail.com"].pagerduty_team_membership.team_membership["order-management"]: Creating...
module.pd_team_association["imparapoc03@gmail.com"].pagerduty_team_membership.team_membership["payment"]: Creating...
module.pd_team_association["imparapoc03@gmail.com"].pagerduty_team_membership.team_membership["order-management"]: Creation complete after 0s [id=POCJ4A2:PWPNALU]
module.pd_team_association["imparapoc03@gmail.com"].pagerduty_team_membership.team_membership["payment"]: Creation complete after 0s [id=POCJ4A2:PP3BZWE]
data.pagerduty_users.pd_users["poc-order-management"]: Reading...
data.pagerduty_users.pd_users["poc-payment"]: Reading...
data.pagerduty_users.pd_users["poc-order-management"]: Read complete after 0s [id=1712468482]
data.pagerduty_users.pd_users["poc-payment"]: Read complete after 0s [id=1712468482]
pagerduty_escalation_policy.pd_esp["poc-payment"]: Creating...
pagerduty_escalation_policy.pd_esp["poc-order-management"]: Creating...
pagerduty_escalation_policy.pd_esp["poc-payment"]: Creation complete after 1s [id=PPEE5BN]
pagerduty_escalation_policy.pd_esp["poc-order-management"]: Creation complete after 1s [id=P95T4LK]
pagerduty_service.pd_service["poc-payment"]: Creating...
pagerduty_service.pd_service["poc-order-management"]: Creating...
pagerduty_service.pd_service["poc-order-management"]: Creation complete after 0s [id=PKKWWBP]
pagerduty_service.pd_service["poc-payment"]: Creation complete after 0s [id=PHO8VLM]
pagerduty_service_integration.datadog["poc-order-management"]: Creating...
pagerduty_service_integration.datadog["poc-payment"]: Creating...
pagerduty_service_integration.datadog["poc-payment"]: Creation complete after 1s [id=PU5R7SE]
pagerduty_service_integration.datadog["poc-order-management"]: Creation complete after 1s [id=PXEC854]

Apply complete! Resources: 11 added, 0 changed, 10 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":12,"Program":"tfcmt","SHA1":"c28b12eb9efe5bf7b757638e2c5735b79a1ee460","Vars":{},"WorkflowName":"Apply Terraform"} -->